app/controllers/leads_controller.rb

  def create
    @lead = Lead.new(lead_params)

    respond_to do |format|
      if @lead.save
---
INSERT INTO "leads" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-02-12 10:03:44.595121"], ["email", "teste@teste.com.br"], ["updated_at", "2015-02-12 10:03:44.595121"]]